In [58]:
import pandas as pd
carstocks = pd.read_csv('data/car_stocks.csv')
# csv파일 pandas로 불러오기

In [59]:
carstocks['Open'].mean()
# 자동차 주가 전체의 시작가격의 평균

79.46974371794873

In [60]:
carstocks[carstocks['Symbol']=='RIVN']['Close'].mean()
# RIVN 회사의 종가 평균

127.52307653846154

In [61]:
carstocks.groupby('Symbol')['Close'].mean()
# 세가지 회사의 종가 평균

Symbol
GM       62.164615
LCID     49.829231
RIVN    127.523077
Name: Close, dtype: float64

In [63]:
titanic = pd.read_csv('data/titanic.csv')
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,?,C,?,328,?
1305,3,0,"Zabour, Miss. Thamine",female,?,1,0,2665,14.4542,?,C,?,?,?
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.225,?,C,?,304,?
1307,3,0,"Zakarian, Mr. Ortin",male,27,0,0,2670,7.225,?,C,?,?,?
1308,3,0,"Zimmerman, Mr. Leo",male,29,0,0,315082,7.875,?,S,?,?,?

In [112]:
titanic['age'] = titanic['age'].replace(['?'],[None]).astype(float)
# replace는 재배치 메소드이다.

In [153]:
m = 11700 - 3900 - 3400 - 2200
print(str(m)+"원")

2200원

- NaN은 데이터 없다.
- ?는 문자형이여서 숫자를 연산 할 수 없다.

In [155]:
print("Float : 숫자 데이터를 나누게 되면 나머지가 있는 경우가 있다. 이런 경우,")
print("표현해야 할 필요가 있는데, float이라는 데이터 타입으로 바꿔주면 소숫점 4자리")
print("까지를 기록할 수 있다.")

Float : 숫자 데이터를 나누게 되면 나머지가 있는 경우가 있다. 이런 경우,
표현해야 할 필요가 있는데, float이라는 데이터 타입으로 바꿔주면 소숫점 4자리
까지를 기록할 수 있다.

In [183]:
df = titanic[['pclass','survived','sex','age']]
df
# 에러메세지가 뜨면 읽어보자

      pclass  survived     sex      age
0          1         1  female  29.0000
1          1         1    male   0.9167
2          1         0  female   2.0000
3          1         0    male  30.0000
4          1         0  female  25.0000
...      ...       ...     ...      ...
1304       3         0  female  14.5000
1305       3         0  female      NaN
1306       3         0    male  26.5000
1307       3         0    male  27.0000
1308       3         0    male  29.0000

[1309 rows x 4 columns]

In [225]:
df = titanic[['pclass','survived','sex','age']]
df.groupby('sex').mean()
# 그룹바이를 사용하자

          pclass  survived        age
sex
female  2.154506  0.727468  28.687071
male    2.372479  0.190985  30.585233

In [232]:
df[df['survived']==1]['age'].mean()
# 생존한 사람들의 나이 평균

28.918228103044495

In [241]:
df = titanic[['pclass','survived','sex','age']]
df[df['sex']=='male'].mean()

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_6140\636809000.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df[df['sex']=='male'].mean()

pclass       2.372479
survived     0.190985
age         30.585233
dtype: float64

In [243]:
gbo=df.groupby(by="sex")
# By는 기준, 수단을 가리킨다. 그래서 성별을 기준으로 데이터를 group으로 나눈다.
gbo.get_group('male')

      pclass  survived   sex      age
1          1         1  male   0.9167
3          1         0  male  30.0000
5          1         1  male  48.0000
7          1         0  male  39.0000
9          1         0  male  71.0000
...      ...       ...   ...      ...
1302       3         0  male      NaN
1303       3         0  male      NaN
1306       3         0  male  26.5000
1307       3         0  male  27.0000
1308       3         0  male  29.0000

[843 rows x 4 columns]

In [276]:
for row in gbo:
    print(row[0])
# 첫번째 데이터
    print('--------')
    print(row[1])
# 두번쨰 데이터

female
--------
      pclass  survived     sex   age
0          1         1  female  29.0
2          1         0  female   2.0
4          1         0  female  25.0
6          1         1  female  63.0
8          1         1  female  53.0
...      ...       ...     ...   ...
1286       3         1  female  38.0
1290       3         1  female  47.0
1300       3         1  female  15.0
1304       3         0  female  14.5
1305       3         0  female   NaN

[466 rows x 4 columns]
male
--------
      pclass  survived   sex      age
1          1         1  male   0.9167
3          1         0  male  30.0000
5          1         1  male  48.0000
7          1         0  male  39.0000
9          1         0  male  71.0000
...      ...       ...   ...      ...
1302       3         0  male      NaN
1303       3         0  male      NaN
1306       3         0  male  26.5000
1307       3         0  male  27.0000
1308       3         0  male  29.0000

[843 rows x 4 columns]